app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("created_at", "description", "title", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2015-06-19 18:39:37.406118"], ["description", "The boat has launched"], ["title", "Boat launched"], ["updated_at", "2015-06-19 18:39:37.406118"]]