app/controllers/updates_controller.rb

  def index
    @updates = Update.all
---
SELECT "updates".* FROM "updates"